Tekla Open API Reference for Tekla Structures 2025
AnalysisResultPositions Class
 The AnalysisResultPositions class contains information about analysis result positions.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisResultPositions
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisResultPositions
Public NotInheritable Class AnalysisResultPositions
The AnalysisResultPositions type exposes the following members.
Constructors
Name | Description
AnalysisResultPositions
 Creates a new analysis result positions instance.
Top
Properties
Name | Description
aPositions
 The position types.
aPositionsX
 The X coordinates of the positions.
aPositionsY
 The Y coordinates of the positions.
aPositionsZ
 The Z coordinates of the positions.
nPositions
 The number of returned positions.
ObjectId
 The identifier of the object.
ObjectType
 The object type. In result query the only supported type is the physical member (the part).
Top
Methods
Name | Description
GetResultPositions
 Gets the analysis result positions.
Top
Examples
 The following example queries the available analysis result positions for the object.
using Tekla.Structures.Analysis;
using System.Collections;
public class Example
{
       public void Example1()
       {
           int PartId = 0;
           AnalysisResultPositions ResultPositions = new AnalysisResultPositions();
           ResultPositions.ObjectType = AnalysisResult.ObjectTypeEnum.OBJECT_TYPE_PART;
           ResultPositions.ObjectId = PartId;
           bool Result = ResultPositions.GetResultPositions();
           ArrayList ValuePositions = ResultPositions.aPositions;
           ArrayList ValuePositionsX = ResultPositions.aPositionsX;
           ArrayList ValuePositionsY = ResultPositions.aPositionsY;
           ArrayList ValuePositionsZ = ResultPositions.aPositionsZ;
       }
}
See Also
Reference
Tekla.Structures.Analysis Namespace